package _02_homework;

/**
 * 方法是Java代码中最常用的语法结构，这里对方法的语法做一下练习。
 * 在使用方法或者想要写一个方法时，首先要考虑的是方法需要的参数是什么数据类型，需要几个（形式参数）
 * ，再考虑方法需要返回什么结果（返回值类型）。在调用方法时，需要搞清楚具体传入什么数值（实际参数）。
 *
 * 实现以下需求：  使用for循环遍历n以内的奇数，并计算所有的奇数的和并输出。
 *
 * 打印倒三角形，并且行数（line）是可控制的。比如我想打印6行的倒三角形，则如下图：  ****** ***** ****     ***  **   *
 *
 * 根据键盘录入打印nn乘法表，n是可变的。  键盘录入一个int数字，判断它是奇数还是偶数。
 *
 * 根据键盘录入打印n行m列井号，n和m是可变的。
 *
 * （扩展题）输出前n个数当中的所有素数，并统计个数。
 * 注：可以百度查一下如何求素数，该题作为扩展题，可以不做。
 *
 * @author zxcsjf
 * @since 2022/06/07 19:41
 */
public class Solution6 {
}
